"""
Определите максимальное количество идущих подряд символов, среди которых не более двух точек.
"""

f = open("").readline()
m_l = 0 



f = f.split(".")
for i in range(len(f) - 2):
    s = f[i] + "." + f[i+1] + "." +f[i+2]
    m_l = max(m_l, len(s))

print(m_l)
