"""
Отработка

Task 4

Рассмотрим произвольное натуральное число, представим его всеми возможными способами в виде произведения двух  
натуральных чисел и найдём для каждого такого произведения разность сомножителей. Например, для числа 16 получим:  
16=16*1=8*2=4*4, множество разностей содержит числа 15, 6 и 0. Найдите все натуральные 
числа, принадлежащие отрезку [2000000;3000000], у которых составленное описанным способом 
множество разностей будет содержать не меньше трёх элементов, не превышающих 115. В ответе перечислите найденные 
числа в порядке возрастания.

Answer: 
2053440
2098080
2328480
2638944
"""

